In [67]:
import pandas as pd

df = pd.DataFrame(data= {'name':['john', 'mary', 'peter','jeff','bill', 'lisa'], 'age':[23, 78, 22, 19, 45, 33],
                         'state': ['iowa', 'dc', 'california', 'texas', 'washington', 'dc'], 'num_children': [2, 2, 0, 1, 2, 1],
                        'num_pets' : [0, 4, 0, 5, 0, 0]})

In [2]:
df

    name  age       state  num_children  num_pets
0   john   23        iowa             2         0
1   mary   78          dc             2         4
2  peter   22  california             0         0
3   jeff   19       texas             1         5
4   bill   45  washington             2         0
5   lisa   33          dc             1         0

In [3]:
df.columns

Index(['name', 'age', 'state', 'num_children', 'num_pets'], dtype='object')

In [5]:
df[['name', 'age', 'state']]

    name  age       state
0   john   23        iowa
1   mary   78          dc
2  peter   22  california
3   jeff   19       texas
4   bill   45  washington
5   lisa   33          dc

In [10]:
type(df.loc[2:4, 'name'])

pandas.core.series.Series

In [9]:
df.loc[2:4, ['name', 'age']]

    name  age
2  peter   22
3   jeff   19
4   bill   45

In [11]:
df.iloc[:2]

   name  age state  num_children  num_pets
0  john   23  iowa             2         0
1  mary   78    dc             2         4

In [18]:
df.iloc[::-1]

    name  age       state  num_children  num_pets
5   lisa   33          dc             1         0
4   bill   45  washington             2         0
3   jeff   19       texas             1         5
2  peter   22  california             0         0
1   mary   78          dc             2         4
0   john   23        iowa             2         0

In [19]:
df.iloc[:,[0]]

    name
0   john
1   mary
2  peter
3   jeff
4   bill
5   lisa

In [24]:
df.loc[:, ['age', 'state']]
#df[['age', 'state']] same output

   age       state
0   23        iowa
1   78          dc
2   22  california
3   19       texas
4   45  washington
5   33          dc

In [25]:
df.iloc[[1]]

   name  age state  num_children  num_pets
1  mary   78    dc             2         4

In [32]:
#Age greater than 30
df[df['age'] > 30]

   name  age       state  num_children  num_pets
1  mary   78          dc             2         4
4  bill   45  washington             2         0
5  lisa   33          dc             1         0

In [34]:
#Same output
df[df.age > 30]

   name  age       state  num_children  num_pets
1  mary   78          dc             2         4
4  bill   45  washington             2         0
5  lisa   33          dc             1         0

In [35]:
# More pets than children
df[df['num_pets'] > df['num_children']]

   name  age  state  num_children  num_pets
1  mary   78     dc             2         4
3  jeff   19  texas             1         5

In [44]:
#and condition
len(df[(df['age'] > 40) & (df['num_pets'] > 0)])

1

In [45]:
len(df)

6

In [56]:
#or condition
df[(df['age'] > 40) | (df['num_pets'] > 0)]

   name  age       state  num_children  num_pets
1  mary   78          dc             2         4
3  jeff   19       texas             1         5
4  bill   45  washington             2         0

In [68]:
#df isn't modified, a copy is returned
#axis 1 is column, 0 is row
df.drop(['age', 'num_children'], axis=1)

    name       state  num_pets
0   john        iowa         0
1   mary          dc         4
2  peter  california         0
3   jeff       texas         5
4   bill  washington         0
5   lisa          dc         0

In [71]:
df.describe()

             age  num_children  num_pets
count   6.000000      6.000000  6.000000
mean   36.666667      1.333333  1.500000
std    22.384518      0.816497  2.345208
min    19.000000      0.000000  0.000000
25%    22.250000      1.000000  0.000000
50%    28.000000      1.500000  0.000000
75%    42.000000      2.000000  3.000000
max    78.000000      2.000000  5.000000

In [72]:
sum(df['age']/len(df))

36.66666666666667

In [73]:
sum(df['num_children']/len(df))

1.3333333333333333

In [74]:
sum(df['num_pets']/len(df))

1.5

In [75]:
import numpy as np
df[['age', 'num_children', 'num_pets']].mean()

age             36.666667
num_children     1.333333
num_pets         1.500000
dtype: float64

In [76]:
df[['age', 'num_children', 'num_pets']].sum()

age             220
num_children      8
num_pets          9
dtype: int64

In [77]:
df.sum()

name                    johnmarypeterjeffbilllisa
age                                           220
state           iowadccaliforniatexaswashingtondc
num_children                                    8
num_pets                                        9
dtype: object

In [78]:
df[['age', 'num_children', 'num_pets']].apply(lambda col: np.mean(col), axis=0)

age             36.666667
num_children     1.333333
num_pets         1.500000
dtype: float64

In [159]:
df = pd.read_csv('titanic.csv')
df[df['Sex'] == 'female']['Age'].mean()

27.915708812260537

In [160]:
ls_gender = df['Sex'].values
ls_age = df['Age'].values

In [165]:
def female_average_age(ls_age, ls_gender):
    total = 0
    length = 0
    for i, j in zip(ls_age, ls_gender):
        if np.isnan(i) == False and j == 'female':
            total += i
            length += 1
            
    return total / length

In [166]:
print(female_average_age(ls_age, ls_gender))

27.915708812260537

In [169]:
df = pd.DataFrame(data= {'name':['john', 'mary', 'peter','jeff','bill', 'lisa'], 'age':[23, 78, 22, 19, 45, 33],
                         'state': ['iowa', 'dc', 'california', 'texas', 'washington', 'dc'], 'num_children': [2, 2, 0, 1, 2, 1],
                        'num_pets' : [0, 4, 0, 5, 0, 0]})

In [175]:
df['age'].values

array([23, 78, 22, 19, 45, 33])

In [177]:
df[['age']]

   age
0   23
1   78
2   22
3   19
4   45
5   33

In [178]:
df[['age']].apply(lambda value: value*2)

   age
0   46
1  156
2   44
3   38
4   90
5   66

In [179]:
df['new c']= df['age']*df['num_children']

In [180]:
df

    name  age       state  num_children  num_pets  new c
0   john   23        iowa             2         0     46
1   mary   78          dc             2         4    156
2  peter   22  california             0         0      0
3   jeff   19       texas             1         5     19
4   bill   45  washington             2         0     90
5   lisa   33          dc             1         0     33

In [181]:
df.sort_values('age', ascending= True)

    name  age       state  num_children  num_pets  new c
3   jeff   19       texas             1         5     19
2  peter   22  california             0         0      0
0   john   23        iowa             2         0     46
5   lisa   33          dc             1         0     33
4   bill   45  washington             2         0     90
1   mary   78          dc             2         4    156

In [184]:
df[df.apply(lambda row: row['name'].startswith('j'), axis=1)]

   name  age  state  num_children  num_pets  new c
0  john   23   iowa             2         0     46
3  jeff   19  texas             1         5     19

In [185]:
from collections import OrderedDict
from pandas import DataFrame
import pandas as pd
import numpy as np

table = OrderedDict((
    ("Item", ['Item0', 'Item0', 'Item1', 'Item1']),
    ('CType',['Gold', 'Bronze', 'Gold', 'Silver']),
    ('USD',  ['1$', '2$', '3$', '4$']),
    ('EU',   ['1€', '2€', '3€', '4€'])
))
d = DataFrame(table)
p = d.pivot(index='Item', columns='CType', values='USD')

In [186]:
d

    Item   CType USD  EU
0  Item0    Gold  1$  1€
1  Item0  Bronze  2$  2€
2  Item1    Gold  3$  3€
3  Item1  Silver  4$  4€

In [187]:
p

CType Bronze Gold Silver
Item
Item0     2$   1$    NaN
Item1    NaN   3$     4$